accept_document1.xml

<?xml version="1.0"?>
<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>AcceptDocument</wsa:Action>
    <wsa:MessageID>urn:uuid:35219f46-bd90-409d-a26c-f282e5bbe3e8</wsa:MessageID>
    <wsa:To>https://te-ws.puesc.gov.pl/seap_wsChannel/DocumentHandlingPort</wsa:To>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:AcceptDocumentRequest xmlns:ns0="http://www.mf.gov.pl/uslugiBiznesowe/WsPull/Usluga/2014/01_v2_0">
      <ns1:document xmlns:ns1="http://www.mf.gov.pl/schematy/SISC/WsChannel/2014/01_v2_0">
        <ns1:content filename="taxfree.xml" mime="application/xml">YUdWc2JHOHNJSGR2Y214a0lRPT0=</ns1:content>
        <ns1:targetSystems xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" filename="taxfree.xml" mime="application/xml" xsi:type="ns1:contentType">YUdWc2JHOHNJSGR2Y214a0lRPT0=</ns1:targetSystems>
      </ns1:document>
    </ns0:AcceptDocumentRequest>
  </soap-env:Body>
</soap-env:Envelope>

zeep.exceptions.Fault: These policy alternatives can not be satisfied:
{http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702}SupportingTokens
{http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702}UsernameToken
{http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702}WssUsernameToken10
{http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702}HashPassword
