tf5_request.xml

<?xml version="1.0"?>
<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action>AcceptDocument</wsa:Action>
    <wsa:MessageID>urn:uuid:89fbdc15-8f08-4ed3-8c2a-7fb438be8cff</wsa:MessageID>
    <wsa:To>https://te-ws.puesc.gov.pl/seap_wsChannel/DocumentHandlingPort</wsa:To>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>rtbtrt6@gmail.com</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">lndLQKr9NcMwjW18Yioxbgt5gRY=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GOUa6/gx2s00BbTUQ+oW0w==</wsse:Nonce>
        <wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2022-09-21T06:11:46+00:00</wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap-env:Header>
  <soap-env:Body>
    <ns0:AcceptDocumentRequest xmlns:ns0="http://www.mf.gov.pl/uslugiBiznesowe/WsPull/Usluga/2014/01_v2_0">
      <ns1:document xmlns:ns1="http://www.mf.gov.pl/schematy/SISC/WsChannel/2014/01_v2_0">
        <ns1:content filename="taxfree.xml" mime="application/xml">PHRuczpaYXB5dGFuaWVEbHVnaWUgeG1sbnM6dG5zPSJodHRwOi8vdGF4ZnJlZS5nb3YucGwvdGY1Igp4bWxuczp0bnMxPSJodHRwOi8vdGF4ZnJlZS5nb3YucGwvdGZ0eXBlcy8iCnhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2UiCnhzaTpzY2hlbWFMb2NhdGlvbj0iaHR0cDovL3RheGZyZWUuZ292LnBsL3RmNSI+Cjx0bnM6TnVtZXJVTlM+MjFQTDAwVEYwMDAxMjM0NTY8L3RuczpOdW1lclVOUz4KPC90bnM6WmFweXRhbmllRGx1Z2llPgo=</ns1:content>
        <ns1:targetSystems>
          <ns1:system>TAX FREE</ns1:system>
        </ns1:targetSystems>
      </ns1:document>
    </ns0:AcceptDocumentRequest>
  </soap-env:Body>
</soap-env:Envelope>
